[
  {
    "chef_id": 1001,
    "chef_picture": "https://images.unsplash.com/photo-1573637798035-53c4aa94d094?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
    "chef_name": "Li Ming",
    "years_of_experience": 15,
    "num_of_recipes": 4,
    "likes": 1500,
    "description": "Chef Li Ming is a master of Sichuan cuisine, known for his fiery and bold flavors. He trained at the prestigious Sichuan Culinary Institute and has since worked in top restaurants in China and abroad, including Michelin-starred establishments. He is particularly skilled at creating complex, multi-layered flavors using the wide range of spices and herbs used in Sichuan cuisine."
  },
  {
    "chef_id": 2002,
    "chef_picture": "https://images.unsplash.com/photo-1581299894007-aaa50297cf16?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
    "chef_name": "Chen Wei",
    "years_of_experience": 3,
    "num_of_recipes": 3,
    "likes": 200,
    "description": "Chef Chen Wei specializes in Cantonese cuisine, with a focus on seafood. He grew up in a family of fishermen and learned to cook with the freshest ingredients. He has since trained in some of the best Cantonese restaurants in China and Hong Kong, and is particularly known for his delicate and refined flavors. His signature dishes include steamed whole fish with ginger and scallions, and crispy fried lobster with garlic and chili."
  },
  {
    "chef_id": 3003,
    "chef_picture": "https://images.unsplash.com/photo-1614011563312-ae9cca2add17?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
    "chef_name": "Wang Xia",
    "years_of_experience": 5,
    "num_of_recipes": 3,
    "likes": 350,
    "description": "Chef Wang Xia is a master of Huaiyang cuisine, which is known for its intricate knife skills and presentation. She trained at the Huaiyang Cuisine Institute and has worked in some of the top hotels and restaurants in China and abroad. Her dishes are known for their elegance and sophistication, with a focus on light and fresh flavors. Her signature dishes include crystal shrimp dumplings, braised pork belly with soy sauce and rock sugar, and sweet and sour Mandarin fish."
  },
  {
    "chef_id": 4004,
    "chef_picture": "https://images.unsplash.com/photo-1559575003-fb4ee38a747d?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=386&q=80",
    "chef_name": "Liu Chang",
    "years_of_experience": 8,
    "num_of_recipes": 3,
    "likes": 650,
    "description": "Chef Liu Chang is a master of Hunan cuisine, known for its bold and spicy flavors. He grew up in the Hunan province and learned to cook from his grandmother, who taught him the secrets of Hunan cuisine. He has since worked in top restaurants in China and abroad, and is particularly skilled at balancing flavors and textures. His signature dishes include Mao's braised pork belly, spicy fried chicken, and stir-fried pork with peppers and black bean sauce."
  },
  {
    "chef_id": 5005,
    "chef_picture": "https://plus.unsplash.com/premium_photo-1673830186289-b4d2619212b3?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
    "chef_name": "Yang Wei",
    "years_of_experience": 7,
    "num_of_recipes": 3,
    "likes": 600,
    "description": "Chef Yang Wei specializes in Shandong cuisine, which is known for its hearty and savory flavors. He trained at the Shandong Cuisine Institute and has worked in some of the best Shandong restaurants in China and abroad. He is particularly known for his use of meat and seafood, and his dishes often include braised, stewed or simmered preparations. His signature dishes include braised sea cucumber with scallions, stir-fried clams with ginger and scallions, and slow-cooked pork belly with soy sauce and spices."
  },
  {
    "chef_id": 6006,
    "chef_picture": "https://images.unsplash.com/photo-1574164052277-b9ea797de8e4?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
    "chef_name": "Zhang Wei",
    "years_of_experience": 12,
    "num_of_recipes": 4,
    "likes": 1200,
    "description": "Chef Zhang Wei is a master of Fujian cuisine, known for its light and delicate flavors. He grew up in the Fujian province and learned to cook from his mother, who taught him the traditions of Fujian cuisine. He has since worked in some of the top Fujian restaurants in China and abroad, and is particularly known for his use of seafood and soups. His signature dishes include fish ball soup, seafood hot pot, and stir-fried rice noodles with seafood and vegetables."
  }
]
